In [2]:
#Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [3]:
# Project folder path
path = r'C:\Users\BhuwanDhakal\Sunita\Projects\2 Data Immersion\Python fundamental for Data Analysis\01-2024 Instacart Basket analysis'

In [4]:
path

'C:\\Users\\BhuwanDhakal\\Sunita\\Projects\\2 Data Immersion\\Python fundamental for Data Analysis\\01-2024 Instacart Basket analysis'

In [5]:
# Importing customers Dataframe 
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [6]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
# Checking for  Statistics
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# Checking the number of rows and columns before clean up
df_customers.shape

(206209, 10)

# Wrangling datas

### Renaming  and Dropping columns

In [9]:
# Renaming column STATE to State
df_customers.rename(columns={'STATE' : 'State'}, inplace = True)

In [10]:
# Renaming column n_dependants to Number-of_Dependants
df_customers.rename(columns={'n_dependants' : 'Number_of_Dependants'}, inplace = True)

In [11]:
# Renaming column fam_status to Marital_Status
df_customers.rename(columns={'fam_status' : 'Family_Status'}, inplace = True)

In [12]:
# Finding the missing values of the Dataframe
df_customers.isnull().sum()

user_id                     0
First Name              11259
Surnam                      0
Gender                      0
State                       0
Age                         0
date_joined                 0
Number_of_Dependants        0
Family_Status               0
income                      0
dtype: int64

#### The output shows there are 11259 missing values in first_name column. Since we will not use name for the analysis, we treat this by dropping the column along with last name

In [13]:
# Dropping the column first name and Surname
df_customers_1 = df_customers.drop(columns = ['First Name', 'Surnam'])

In [14]:
# Checking the data type of df_customers_1
df_customers_1.dtypes

user_id                  int64
Gender                  object
State                   object
Age                      int64
date_joined             object
Number_of_Dependants     int64
Family_Status           object
income                   int64
dtype: object

In [15]:
# Changing data type of user_id in df_customers_1
df_customers_1['user_id'] = df_customers_1['user_id'].astype('str')

In [16]:
df_customers_1['user_id'].dtype

dtype('O')

In [17]:
# Check for the mixed data types
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].applymap(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
if len (df_customers[weird]) > 0:
    print ("Column " + col + " has mixed data type")
else:
    print ("No columns with mixed datatype")

No columns with mixed datatype

## Finding Duplicates

In [18]:
df_dups = df_customers_1[df_customers_1.duplicated()]

In [19]:
df_dups

Empty DataFrame
Columns: [user_id, Gender, State, Age, date_joined, Number_of_Dependants, Family_Status, income]
Index: []

#### There are no Duplicates values in Dataframe

## Combining and Exporting Data

In [20]:
# Importing ords_prods_updated.pkl dataframe
ords_prods_grouped = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_grouped.pkl'))

In [21]:
df_customers_1.head()

,user_id,Gender,State,Age,date_joined,Number_of_Dependants,Family_Status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

In [22]:
#Checking for the data types in ords_prods_grouped
ords_prods_grouped.dtypes

product_id                       int64
product_name                    object
aisle_id                         int64
department_id                    int64
prices                         float64
order_id                         int64
user_id                          int64
order_number                     int64
orders_day_of_week               int64
time_of_day                      int64
days_since_prior_order         float64
First_Order                     object
add_to_cart_order                int64
reordered                        int64
_merge                        category
price_range_loc                 object
busiest_day                     object
busiest_days_modified           object
busiest_period_of_day           object
max_order                        int64
loyalty_flag                    object
mean_product_price             float64
spending_flag                   object
median_days_between_orders     float64
order_frequency                 object
dtype: object

In [23]:
# Changing data type of user_id in ords_prods_grouped
ords_prods_grouped['user_id'] = ords_prods_grouped['user_id'].astype('str')

In [24]:
ords_prods_grouped['user_id'].dtype

dtype('O')

In [25]:
# Merge df_customers_1 and ords_prods_grouped using user_id as a key 

df_merged = df_customers_1.merge(ords_prods_grouped, on = ['user_id'])

In [26]:
df_merged.head()

,user_id,Gender,State,Age,date_joined,Number_of_Dependants,Family_Status,income,product_id,product_name,...,price_range_loc,busiest_day,busiest_days_modified,busiest_period_of_day,max_order,loyalty_flag,mean_product_price,spending_flag,median_days_between_orders,order_frequency
0,26711,Female,Missouri,48,1/1/2017,3,married,165665,196,Soda,...,Mid-range product,Regularly busy,Busiest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
1,26711,Female,Missouri,48,1/1/2017,3,married,165665,196,Soda,...,Mid-range product,Regularly busy,Regular days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
2,26711,Female,Missouri,48,1/1/2017,3,married,165665,196,Soda,...,Mid-range product,Regularly busy,Busiest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
3,26711,Female,Missouri,48,1/1/2017,3,married,165665,6184,Clementines,...,Low-range product,Regularly busy,Regular days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer
4,26711,Female,Missouri,48,1/1/2017,3,married,165665,6184,Clementines,...,Low-range product,Regularly busy,Slowest days,Most orders,8,New customer,7.988889,Low spender,19.0,Regular customer

In [27]:
# checking the shape of the merged dataframe
df_merged.shape

(32404859, 32)

In [28]:
# Export dataframe to final_combined_data
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'final_combined_data.pkl'))